{
    "locations": [
     {
          "name":"Sample",
          "latitude":"37.72529",
          "longitude":"-122.451151",
          "description":"This sample is a the lat/long for CCSF",
          "imgpath":"/sample/path",
          "imgtitle":"sample title",
          "thumbpath":"sample/thumb",
     },
     
     {
          "name":"Osama Bin Laden's Condo",
          "latitude":"37.791447",
          "longitude":"-122.413407",
          "description":"Osama Bin Laden lived here in the 1970's when he was a rich Saudi playboy",
          "imgpath":"/sample/path",
          "imgtitle":"sample title",
          "thumbpath":"sample/thumb",
     },
     
     {
     "name":"Sutro Baths",
     "latitude":"37.779806",
     "longitude":"-122.513566",
     "imgpath":"imgpath",
     "subtitle":"subtitle",
     "thumbpath":"thumbpath",
     "description":"On a stroll through the Sutro Bath ruins, one-armed Uncle Victor (Charles Tyner) offers morose young Harold (Bud Cort) a lesson on the joys of military service in Harold and Maude. 'Only one thing kept going through my mind. Kill! Kill for Joe and Mack and all the rest of the guys! Kill!' The 1971 feature directed by Hal Ashby is one of the cinema's greatest dark comedies. Harold is obsessed with death until he meets 79 year-old free spirit Maude. Highlights include several fake suicide attempts Harold stages to horrify his guileless mother, played by Vivian Pickles. Ruth Gordon is total perfection as Maude. San Franciscans will also appreciate one scene that exquisitely documents the former landmark collection of makeshift sculpture that used to dot the mudflats near west bound I-80 and the Bay Bridge and was for many years considered a blight by some.  -MisterSF.com",
      },
      
      {
     "name":"Tommy's Joynt",
     "latitude":"37.785639",
     "longitude":"-122.421727",
     "imgpath":"imgpath",
     "subtitle":"subtitle",
     "thumbpath":"thumbpath",
     "description":"Tommy's Joynt is the original hof-brau of San Francisco , and has become one of San Francisco's longest living institutions. We sit here at Van Ness and Geary, on Route 101, at the crossroads of the City. 'Welcome Stranger' decals itself above our front doors, front doors that beg you to come inside and eat 'Where Turkey is King.' While the City has been changing year after year, we remain steadfast in our opposition to change.  -Tommysjoynt.com",
      },
      
      {
     "name":"City Lights Books",
     "latitude":"37.797696",
     "longitude":"-122.406562",
     "imgpath":"imgpath",
     "subtitle":"subtitle",
     "thumbpath":"thumbpath",
     "description":"Founded in 1953 by poet Lawrence Ferlinghetti and Peter D. Martin, City Lights is one of the truly great independent bookstores in the United States, a place where booklovers from across the country and around the world come to browse, read, and just soak in the ambiance of alternative culture's only 'Literary Landmark.'  -citylights.com",
      },
      
      {
     "name":"Cable Car Barn",
     "latitude":"37.79458",
     "longitude":"-122.411438",
     "imgpath":"imgpath",
     "subtitle":"subtitle",
     "thumbpath":"thumbpath",
     "description":"Inside the historic Cable Car Barn & Powerhouse, visitors can view the actual cable winding machinery from an elevated gallery, as well as the path of the cable entering the building and leaving underneath the street in the sheave room viewing area.  Also on display are various mechanical devices, such as grips, track, trucks, cable and brake mechanisms with corresponding explanations.",
      },
      
      {
     "name":"Clarion Alley",
     "latitude":"37.762971",
     "longitude":"-122.420622",
     "imgpath":"imgpath",
     "subtitle":"subtitle",
     "thumbpath":"thumbpath",
     "description":"Clarion Alley Mural Project (CAMP) is an artists' collective formed in October 1992 by a volunteer collective of six North Mission residents: Aaron Noble, Michael O'Connor, Sebastiana Pastor, Rigo 92, Mary Gail Snyder, and Aracely Soriano. The project creates and facilitates other artists creating murals on Clarion Alley, between Valencia and Mission Streets and surrounding areas. -Wikipedia",
      },
        
    ]
}
